#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database.tf_demo_database will be created
  + resource "snowflake_database" "tf_demo_database" {
      + data_retention_time_in_days = 30
      + id                          = (known after apply)
      + is_transient                = false
      + name                        = "TERRAFORM_DEMO_PROD"
    }

  # module.snowflake_resources.snowflake_database_grant.database_ro_grant will be created
  + resource "snowflake_database_grant" "database_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_schema.tf_demo_schema will be created
  + resource "snowflake_schema" "tf_demo_schema" {
      + data_retention_days = 1
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TF_DEMO"
    }

  # module.snowflake_resources.snowflake_schema_grant.schema_ro_grant will be created
  + resource "snowflake_schema_grant" "schema_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_table.demo_table will be created
  + resource "snowflake_table" "demo_table" {
      + change_tracking     = false
      + comment             = "An empty demo table for Terraform demo"
      + data_retention_days = 1
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + name                = "DEMO_TABLE"
      + owner               = (known after apply)
      + qualified_name      = (known after apply)
      + schema              = "TF_DEMO"

      + column {
          + name     = "id"
          + nullable = true
          + type     = "NUMBER(38,0)"
        }
      + column {
          + name     = "data"
          + nullable = false
          + type     = "text"
        }
      + column {
          + name     = "DATE"
          + nullable = true
          + type     = "TIMESTAMP_NTZ(9)"
        }
    }

  # module.snowflake_resources.snowflake_table_grant.table_ro_grant will be created
  + resource "snowflake_table_grant" "table_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_view_grant.view_ro_grant will be created
  + resource "snowflake_view_grant" "view_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @abhr1994, Action: `pull_request`*